Revit 2026 API

# FamilyElementVisibilityType Enumeration

---

Indicates the Visibility type of generic forms.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FamilyElementVisibilityType
```
```vb
Public Enumeration FamilyElementVisibilityType
```
```cpp
public enum class FamilyElementVisibilityType
```
```fsharp
type FamilyElementVisibilityType
```

| Member name | Value | Description |
| --- | --- | --- |
| Model | 0 | The element will be displayed in 3D views and model other model views. |
| ViewSpecific | 1 | The element will be displayed only in the view where it is created. This applies to items like detail components, annotations, and view-specific imports. |

Use this enum to indicate the visibility type of new forms.

#### Reference

Autodesk.Revit.DB Namespace